tap "homebrew/bundle"
tap "homebrew/services"
tap "sourcegraph/src-cli"
tap "supabase/tap"
tap "ybeapps/sourcegit"
brew "xz"
brew "openssl@3"
brew "bat"
brew "bzip2"
brew "docker"
brew "docker-compose"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "readline"
brew "python@3.13"
brew "httpie"
brew "lima"
brew "nvm"
brew "postgresql@14"
brew "postgresql@15"
brew "postgresql@17"
brew "powerlevel10k"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "qemu"
brew "redis"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "supabase/tap/supabase"
cask "gcloud-cli"
cask "ngrok"
cask "orbstack"
cask "smcfancontrol"
cask "sourcegit"
vscode "adpyke.codesnap"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "cpylua.language-postcss"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fallenmax.styled-components-extractor"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "funkyremi.vscode-google-translate"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "jasonn-porch.gitlab-mr"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "misterj.vue-volar-extention-pack"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.remote-repositories"
vscode "natqe.reload"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "ryu1kn.partial-diff"
vscode "saoudrizwan.claude-dev"
vscode "sdras.vue-vscode-snippets"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "syler.sass-indented"
vscode "sysoev.language-stylus"
vscode "ukoloff.win-ca"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vue.volar"
vscode "wallabyjs.quokka-vscode"
vscode "xabikos.javascriptsnippets"
